#ifndef KEYSCAN_H
#define KEYSCAN_H

#include"typedef.h"


//***********************************************************************************
/////////////需要具体场合具体修改的参数//////////////////////////////////////////////
//***********************************************************************************
//-----------硬件端口定义------------------------------------------------------------

#define P_PIN         P_PE	  //单片机按键硬件接口

#define SET_IO_INPUT  //P_PBIN  //设端口为输入

//***********************************************************************************
//-----------按键延时参数设定--------------------------------------------------------

#define C_KEY_DIS_SHAKE       0//100     //消抖时间 
#define C_KEY_LONG_PERIOD     300//100     //长按时间 
#define C_KEY_WAIT_PERIOD     100//25 	 //定义等待进入连击的时间
#define C_KEY_CONTINUE_PERIOD 100//25 	 //定义按键连击时间间隔


//***********************************************************************************
//----------按键状态-按键高8位为按键状态值-------------------------------------------
 
#define C_KEY_DOWN            0x80 	  //按键按下
#define C_KEY_LONG            0x40	  //长按
#define C_KEY_CONTINUE        0x20 	  //连击
#define C_KEY_CLICK_3		  0x10	  //3击
#define C_KEY_CLICK_6	      0x08	  //6击
#define C_KEY_UP              0x01    //松开按键 定义按键状态

#define C_KEY_NULL            0x00   //没有按键时的状态值

//************************************************************************************
//----------结构定义------------------------------------------------------------------
typedef struct 
{
	INT8U KeyState;//按键状态
	INT8U KeyValue;//键值
}
TYKEY,*pTYKEY;

typedef struct
{
	INT8U HKey;//按键状态
	INT8U VKey;//键值
}
TYKEYFIND;
//************************************************************************************
//----------函数定义------------------------------------------------------------------

#define KeyScanInit() KEYSCANINIT();   //按键初始化
extern INT8U HkeytoVkey(INT8U Hkey);
extern void GetKeyState(TYKEY *pC_KEYValue);//参数为按键指针
extern void TaskKeySan(void);
//************************************************************************************










#endif












